<a href="https://colab.research.google.com/github/Lungelo-cloud/Hub-Analytics/blob/main/Hub_Analytica.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns 
sns.set()

In [2]:
sheet_id = '1WGVWOsjKdp4eP_6PcqdnU7r6r8RW0hAtUVakTlrFWxw'
df = pd.read_csv(f"https://docs.google.com/spreadsheets/d/{sheet_id}/export?format=csv")
df.head()

   Timestamp   First Name  ... Last Name What equipment will you check out?
0  2/11/2021      Kwanele  ...       NaN                                NaN
1  2/11/2021      Simanga  ...       NaN                                NaN
2  2/13/2021      Simanga  ...       NaN                                NaN
3  2/13/2021    Sikhulile  ...       NaN                                NaN
4  2/14/2021  Gcinimiyalo  ...       NaN                                NaN

[5 rows x 13 columns]

In [3]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])
df['Sign-in Time'] = pd.to_datetime(df['Sign-in Time'])
df['What time do you expect to be out of The Hub?'] = pd.to_datetime(df['What time do you expect to be out of The Hub?'])
df['Time Duration(hrs)'] = (df['What time do you expect to be out of The Hub?']-df['Sign-in Time'])/np.timedelta64(1,'h')
df.dtypes

Timestamp                                        datetime64[ns]
First Name                                               object
Phone Number                                             object
Sign-in Time                                     datetime64[ns]
What are you working on today?                           object
What equipment will you use?                             object
Internet?                                                object
What time do you expect to be out of The Hub?    datetime64[ns]
Are you a member of The Hub?                             object
Are you a student (from any institution)?                object
What company do you work for?                            object
Last Name                                                object
What equipment will you check out?                      float64
Time Duration(hrs)                                      float64
dtype: object

In [4]:
df = df.set_index('Timestamp')

In [5]:
missing_data = df.isnull()
for column in missing_data.columns.values.tolist():
  print(column)
  print(missing_data[column].value_counts())
  print("")

First Name
False    491
Name: First Name, dtype: int64

Phone Number
False    433
True      58
Name: Phone Number, dtype: int64

Sign-in Time
False    491
Name: Sign-in Time, dtype: int64

What are you working on today?
False    491
Name: What are you working on today?, dtype: int64

What equipment will you use?
False    491
Name: What equipment will you use?, dtype: int64

Internet?
False    490
True       1
Name: Internet?, dtype: int64

What time do you expect to be out of The Hub?
False    470
True      21
Name: What time do you expect to be out of The Hub?, dtype: int64

Are you a member of The Hub?
False    388
True     103
Name: Are you a member of The Hub?, dtype: int64

Are you a student (from any institution)?
True     435
False     56
Name: Are you a student (from any institution)?, dtype: int64

What company do you work for?
True     433
False     58
Name: What company do you work for?, dtype: int64

Last Name
True     433
False     58
Name: Last Name, dtype: int64

What equipment will you check out?
True    491
Name: What equipment will you check out?, dtype: int64

Time Duration(hrs)
False    470
True      21
Name: Time Duration(hrs), dtype: int64

In [6]:
df1 = df.loc['2021-08-09 00:00:00':'2021-08-15 23:00:00']
df2 = df1['What are you working on today?']
splitting_columns = lambda x: pd.Series([i for i in reversed(x.split(','))])
df2 = df2.apply(splitting_columns)
df2[0] = df2[0].str.strip()
df2[1] = df2[1].str.strip()
df2[2] = df2[2].str.strip()
df3 = df2[0].append(df2[1], ignore_index=True)
df4 = df3.append(df2[2], ignore_index=True)
df5 = df4.value_counts(dropna=True).to_frame()
df5.columns = ['count']
df5

                      count
Company Work             28
Research                 22
Content & Creativity     17
Coding                   14
Academic Work             4
Meeting                   4

In [7]:
df6 = df1['What company do you work for?']
df7 = df6.value_counts().to_frame()
df7.columns = ['Count']
df7

             Count
Freelancer      29
Snowsen         11
Ummo            10
Vundzisa         3
Kingdom XLR      3
Guwava           1
SV Tech          1

In [8]:
df8 = df1['What equipment will you use?']
df8 = df8.apply(splitting_columns)
df8[0] = df8[0].str.strip()
df8[1] = df8[1].str.strip()
df8[2] = df8[2].str.strip()
df8[3] = df8[3].str.strip()
df9 = df8[0].append(df8[1], ignore_index=True)
df10 = df9.append(df8[2], ignore_index=True)
df11 = df10.append(df8[3], ignore_index=True)
equipment_used = df11.value_counts(dropna=True).to_frame()
equipment_used.columns = ['count']
equipment_used

                            count
Brought my own workstation     26
Mac Workstation                21
Keyboard                       15
Mouse                          14
PC Workstation                 13
Monitor                        11

In [9]:
d12 = df1['First Name'].str.strip()
d12 = d12.replace('Kwanele Prince', 'Kwanele')
d12 = d12.replace('Tsabedze', 'Kwanele')
d13 = d12.value_counts().to_frame()
d13.columns = ['Count']
hubbers = d13.head(10)
hubbers

               Count
Fanelesibonge      7
José               7
Gcinimiyalo        6
Bafana             6
Tiyandza           5
Lungelo            5
Mlungisi           5
Thobeka            4
Sibahle            3
Kwanele            3

In [15]:
import warnings
warnings.filterwarnings("ignore")
df1['First Name'] = df1['First Name'].str.strip()
df1['First Name'] = df1['First Name'].replace('Kwanele Prince', 'Kwanele')
df1['First Name'] = df1['First Name'].replace('Tsabedze', 'Kwanele') 
df1['Time Duration(hrs)'] = abs(df1['Time Duration(hrs)'])
d14 = df1[['First Name', 'Time Duration(hrs)']]
d14 = d14.groupby(['First Name'], as_index=False).sum()
d14.set_index(['First Name']).sort_values(['Time Duration(hrs)'], ascending=False).head(10)

               Time Duration(hrs)
First Name
Fanelesibonge           83.000000
José                    82.500000
Thobeka                 49.500000
Lungelo                 44.500000
Gcinimiyalo             41.250000
Bafana                  38.500000
Mlungisi                26.366667
Tiyandza                25.500000
Kwanele                 21.583333
Sibahle                 19.816667

In [ ]:
df['Time Duration(hrs)'] = abs(df['Time Duration(hrs)'])